Revit 2026 API

# IDockablePaneProvider Interface

---

Interface that the Revit UI will call during initialization of the user interface to gather information about add-in dockable pane windows.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IDockablePaneProvider
```
```vb
Public Interface IDockablePaneProvider
```
```cpp
public interface class IDockablePaneProvider
```
```fsharp
type IDockablePaneProvider = interface end
```

The IDockablePaneProvider type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SetupDockablePane | Method called during initialization of the user interface to gather information about a dockable pane window. |

#### Reference

Autodesk.Revit.UI Namespace